app/controllers/api/v1/shorturls_controller.rb

			def index
    			@shorturls = Shorturl.unexpired.all
---
SELECT  `shorturls`.* FROM `shorturls` WHERE (expires_at > '2016-04-19 02:33:55.815024')  ORDER BY `shorturls`.`id` DESC LIMIT 1

			def create
				expires_at =  params[:expire_date] || (Time.now + 1.days)
				attributes = {
					longurl: params[:url],
					expires_at: expires_at
				}
				@shorturl_obj = Shorturl.unexpired.where(longurl: params[:url]).first
				if @shorturl_obj.blank?
					Shorturl.create!(attributes)
					@shorturl_obj = Shorturl.where(longurl: params[:url]).last
					@shorturl_obj.shortlink!(request)
					Rails.cache.write(@shorturl_obj.shorturlkey, @shorturl_obj.longurl , expires_in: 1.days)
				end
				respond_to do |format|
			      if @shorturl_obj.id || @shorturl_obj.save
---
SELECT  `shorturls`.* FROM `shorturls` WHERE (expires_at != NULL AND expires_at > '2016-04-18 12:16:00.103184') AND `shorturls`.`longurl` = '\"http://www.google.com\"'  ORDER BY `shorturls`.`id` ASC LIMIT 1
INSERT INTO `shorturls` (`longurl`, `expires_at`, `created_at`, `updated_at`) VALUES ('\"http://www.google.com\"', '2016-04-20 12:16:00', '2016-04-18 12:16:00', '2016-04-18 12:16:00')
UPDATE `shorturls` SET `longurl` = 'http://www.linkedin.com', `expires_at` = '2016-04-20 07:18:11', `created_at` = '2016-04-19 07:18:11', `updated_at` = '2016-04-19 07:18:11', `id` = 1, `shorturlkey` = '10a', `shorturl` = 'localhost:3000/go10a' WHERE `shorturls`.`id` = 1

			def show
				@shorturl_obj = Shorturl.find_by(id: params[:id])
---
SELECT  `shorturls`.* FROM `shorturls` WHERE `shorturls`.`id` = 3 LIMIT 1

			def go
				@longurl = Rails.cache.fetch(params[:shorturlkey])
				if @longurl.blank?
					puts "...........querying from db ........"
			    	@shorturl_obj = Shorturl.unexpired.where(shorturlkey: params[:shorturlkey]).first
---
SELECT  `shorturls`.* FROM `shorturls` WHERE (expires_at > '2016-04-19 14:17:53.235486') AND `shorturls`.`shorturlkey` = '10e'  ORDER BY `shorturls`.`id` ASC LIMIT 1